OdIfcFile.getProjectId
\details
Retrieves the IFC model's root IfcProject instance.
\returns The identifier of the root IfcProject instance of the model.
\remarks
Each valid IFC model must have exactly one root instance.